In [11]:
import pandas as pd

In [12]:
df1=pd.read_csv("data.csv", sep=";")#character seprated value

df2=pd.read_excel("data.xlsx")

df3=pd.read_json("data.json")

display(df1, df2, df3)

         Name  Age  Salary
0        Riya   26   48000
1  Shreyanshi   30   50000

    Name  Age  Salary
0    Raj   28   40000
1  Rahul   29   39000

      Name  Age  Salary
0  Harshit   32   45000
1     Ajay   32   45000

In [13]:
result_df = pd.concat(    [df1,df2,df3] , ignore_index=True  )

result_df

         Name  Age  Salary
0        Riya   26   48000
1  Shreyanshi   30   50000
2         Raj   28   40000
3       Rahul   29   39000
4     Harshit   32   45000
5        Ajay   32   45000

In [14]:
df4 = pd.read_xml("data.xml")

#replace df4 table with a new version where only Location column is used
df4 = df4[    ["Location"]         ]

df4


df4

    Location
0     Mumbai
1      Delhi
2    Chennai
3      Delhi
4    Kolkata
5  Bengaluru

In [15]:
final_df = pd.concat([result_df, df4], axis=1)

final_df

         Name  Age  Salary   Location
0        Riya   26   48000     Mumbai
1  Shreyanshi   30   50000      Delhi
2         Raj   28   40000    Chennai
3       Rahul   29   39000      Delhi
4     Harshit   32   45000    Kolkata
5        Ajay   32   45000  Bengaluru

In [16]:
loc = final_df.pop("Location") #series


final_df.insert(2, "Location",  loc)


final_df

         Name  Age   Location  Salary
0        Riya   26     Mumbai   48000
1  Shreyanshi   30      Delhi   50000
2         Raj   28    Chennai   40000
3       Rahul   29      Delhi   39000
4     Harshit   32    Kolkata   45000
5        Ajay   32  Bengaluru   45000

In [17]:

# SQLALCHEMY (ORM)

# SQL TABLE  


# ORACLE_DB

# SQL_SERVER

# MYSQL

# MARIADB

# POSTGRES


# SQLITE3

In [18]:
import sqlite3

conn = sqlite3.connect("info.db")

#cursor will be used to transfer data between python & database
cursor_obj = conn.cursor()

query="CREATE TABLE Employee(employee_name text, employee_age number, emoloyee_location text, employee_salary number)"

cursor_obj.execute( query  )

conn.commit()

In [19]:
final_df.to_sql("Employee",  conn, if_exists="replace", index=False)

6

In [20]:
results = cursor_obj.execute(    "select * from Employee"    )

In [21]:
results.fetchall()

[('Riya', 26, 'Mumbai', 48000),
 ('Shreyanshi', 30, 'Delhi', 50000),
 ('Raj', 28, 'Chennai', 40000),
 ('Rahul', 29, 'Delhi', 39000),
 ('Harshit', 32, 'Kolkata', 45000),
 ('Ajay', 32, 'Bengaluru', 45000)]

In [23]:
results = cursor_obj.execute(    "select * from Employee order by Age"    )
results.fetchall()

[('Riya', 26, 'Mumbai', 48000),
 ('Raj', 28, 'Chennai', 40000),
 ('Rahul', 29, 'Delhi', 39000),
 ('Shreyanshi', 30, 'Delhi', 50000),
 ('Harshit', 32, 'Kolkata', 45000),
 ('Ajay', 32, 'Bengaluru', 45000)]


SQL                                                                                     PYTHON

database                                                                              final_df

info.db


results.fetchall() ----> whatever SQL rows you found in previous query, convert them into python understandable terms